Revit 2026 API

# ExporterIFCGetDoorWindowOpeningHandle Method

---

Get the handle to the opening associated with a hosted (door/window) element from the internal cache.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAnyHandle GetDoorWindowOpeningHandle(
	ElementId familyInstanceId
)
```
```vb
Public Function GetDoorWindowOpeningHandle (
	familyInstanceId As ElementId
) As IFCAnyHandle
```
```cpp
public:
IFCAnyHandle^ GetDoorWindowOpeningHandle(
	ElementId^ familyInstanceId
)
```
```fsharp
member GetDoorWindowOpeningHandle :
        familyInstanceId : ElementId -> IFCAnyHandle
```

#### Parameters

familyInstanceId ElementId
     The id of the door or window.

#### Return Value

IFCAnyHandle The opening handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace